import React from "react";

// Components
import Navbar from "../components/Navbar/Navbar";

// Assets & Styles
import image1 from "../assets/images/mohilaKormo.jpg";
import image2 from "../assets/images/siraj.jpg";
import "../styles/About.scss";

function About() {
  return (
    <>
      <Navbar />
      <div className="about">
        
        {/* HEADING */}
        <div className="about__heading">
          <h1 className="heading">সম্পর্কিত</h1>
          <img className="image1" src={image1} alt="" />
          <img className="image2" src={image2} alt="" />
          <div className="quote">
            <p className="quote__text">
              <span>&#10077;</span> আমরা তখনই সুখি হবো যখন আমরা আনন্দের সাথে দান
              এবং কৃতজ্ঞচিত্তে সে দান গ্রহন করতে পারবো।
            </p>
            <p className="quote__author"> - মায়া এঞ্জেলোওউ</p>
          </div>
          <div className="text">
            আমরা বিশ্বাস করি সুস্থ্য্ ও সুন্দরভাবে বেচে থাকার অধিকার প্রতিটি
            মানুষের। আমরা সবাই জানি, আমাদের চারপাশেই এমন অনেকেই আছেন যাদের কাছে
            বেচে থাকার জন্য প্রয়োজনীয় মৌলিক বিষয়গুলো অনেক দূর্লভ। তাদের কষ্ট আর
            দূঃক্ষ ভরাক্রান্ত জীবনে যদি আমরা সাহায্যের হাত বাড়িয়ে দেই তবে তারা
            হয়তো তাদের জীবনের এই দূঃক্ষ-দূর্দশা থেকে বের হতে পারবে সাথে সাথে
            একটি সুন্দর জীবন যাপন শুরু করতে পারবে। কিন্তু, বেশিরভাগ সময়ই আমাদের
            একক প্রচেষ্টায় এটি সম্ভবপর হয়ে ওঠেনা। এক্ষেত্রে এক দল স্বেচ্ছাসেবক
            যদি তাদের ব্যক্তিজীবনে দৈন্দিনের অপ্রয়োজনীয় অর্থগুলো অপচয় না করে তা
            জমা করে এসকল মানুষদের জন্য ব্যায় করে তবে সেটি অনেক বেশি ফল্প্রসু হয়।{" "}
            <span>'স্বদিচ্ছা'</span> হচ্ছে এমনই একটি অলাভজনক ও অরাজনৈতীক
            প্রতিষ্ঠান যেটি এমনই উদ্যম এক ঝাক স্বেচ্ছাসেবকদের নিয়ে হতদরিদ্র
            মানুষদের জন্য কাজ করে যেনো, প্রতিটি মানুষ দ্বিধাহীনভাবে বিচরন করতে
            পারে, হাসতে পারে এবং সোনালী স্বপ্ন দেখতে পারে।            
          </div>
        </div>

        <div className="about__description">
          আমরা একগুচ্ছ স্বেচ্ছাসেবক তাদের অক্লান্ত পরিশ্রমের সাহায্যে মানবতার
          জন্য সেবা দিয়ে যাচ্ছি। আমাদের রয়েছে ৪০ জনেরও বেশি কর্মঠ স্বেচ্ছাসেবক ও
          ২৫ জনের বেশি নিয়মিত ডোনার। আমরা বিভিন্ন দুস্থ্য ও অসহায় মানুষের
          শিক্ষা, চিকিৎসা ও স্বাভাবিক জীবন যাপনের নিমিত্তে অর্থ সাহায্য দিয়ে
          থাকি। এছাড়াও বিভিন্ন দূর্যোগে ক্ষতিগ্রস্ত এলাকার মেরামত, দূষিত এলাকা
          পরিষ্কারের মাধ্যমে পরিবেশ উন্নয়নেও ভূমিকা রেখে আসছি। মানবতার সেবা ও
        </div>
      </div>
    </>
  );
}

export default About;
